leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMtu_bf.h
/** \brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU0PTMAP */
#define IFX_MTU_MEMMAP_CPU0PTMAP_OFF (17u)

/** \brief  Length for Ifx_MTU_MEMMAP_Bits.CPU1DxMAP */
#define IFX_MTU_MEMMAP_CPU1DXMAP_LEN (2u)

/** \brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU1DxMAP */
#define IFX_MTU_MEMMAP_CPU1DXMAP_MSK (0x3u)

/** \brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU1DxMAP */
#define IFX_MTU_MEMMAP_CPU1DXMAP_OFF (7u)

/** \brief  Length for Ifx_MTU_MEMMAP_Bits.CPU1PxMAP */
#define IFX_MTU_MEMMAP_CPU1PXMAP_LEN (2u)

/** \brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU1PxMAP */
#define IFX_MTU_MEMMAP_CPU1PXMAP_MSK (0x3u)

/** \brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU1PxMAP */
#define IFX_MTU_MEMMAP_CPU1PXMAP_OFF (10u)

/** \brief  Length for Ifx_MTU_MEMMAP_Bits.CPU2DxMAP */
#define IFX_MTU_MEMMAP_CPU2DXMAP_LEN (2u)

/** \brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU2DxMAP */
#define IFX_MTU_MEMMAP_CPU2DXMAP_MSK (0x3u)

/** \brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU2DxMAP */
#define IFX_MTU_MEMMAP_CPU2DXMAP_OFF (1u)

/** \brief  Length for Ifx_MTU_MEMMAP_Bits.CPU2PxMAP */
#define IFX_MTU_MEMMAP_CPU2PXMAP_LEN (2u)

/** \brief  Mask for Ifx_MTU_MEMMAP_Bits.CPU2PxMAP */
#define IFX_MTU_MEMMAP_CPU2PXMAP_MSK (0x3u)

/** \brief  Offset for Ifx_MTU_MEMMAP_Bits.CPU2PxMAP */
#define IFX_MTU_MEMMAP_CPU2PXMAP_OFF (4u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU0DS2AIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU0DS2AIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU0DS2AIU_OFF (27u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0DSAIU */
#define IFX_MTU_MEMSTAT0_CPU0DSAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0DSAIU */
#define IFX_MTU_MEMSTAT0_CPU0DSAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0DSAIU */
#define IFX_MTU_MEMSTAT0_CPU0DSAIU_OFF (14u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0DxAIU */
#define IFX_MTU_MEMSTAT0_CPU0DXAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0DxAIU */
#define IFX_MTU_MEMSTAT0_CPU0DXAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0DxAIU */
#define IFX_MTU_MEMSTAT0_CPU0DXAIU_OFF (19u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0PSAIU */
#define IFX_MTU_MEMSTAT0_CPU0PSAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0PSAIU */
#define IFX_MTU_MEMSTAT0_CPU0PSAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0PSAIU */
#define IFX_MTU_MEMSTAT0_CPU0PSAIU_OFF (16u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU0PTAIU */
#define IFX_MTU_MEMSTAT0_CPU0PTAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0PTAIU */
#define IFX_MTU_MEMSTAT0_CPU0PTAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0PTAIU */
#define IFX_MTU_MEMSTAT0_CPU0PTAIU_OFF (17u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU1DS2AIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU1DS2AIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU1DS2AIU_OFF (20u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1DSAIU */
#define IFX_MTU_MEMSTAT0_CPU1DSAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1DSAIU */
#define IFX_MTU_MEMSTAT0_CPU1DSAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1DSAIU */
#define IFX_MTU_MEMSTAT0_CPU1DSAIU_OFF (6u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1DTAIU */
#define IFX_MTU_MEMSTAT0_CPU1DTAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1DTAIU */
#define IFX_MTU_MEMSTAT0_CPU1DTAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1DTAIU */
#define IFX_MTU_MEMSTAT0_CPU1DTAIU_OFF (8u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1PSAIU */
#define IFX_MTU_MEMSTAT0_CPU1PSAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1PSAIU */
#define IFX_MTU_MEMSTAT0_CPU1PSAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1PSAIU */
#define IFX_MTU_MEMSTAT0_CPU1PSAIU_OFF (9u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU1PTAIU */
#define IFX_MTU_MEMSTAT0_CPU1PTAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1PTAIU */
#define IFX_MTU_MEMSTAT0_CPU1PTAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1PTAIU */
#define IFX_MTU_MEMSTAT0_CPU1PTAIU_OFF (11u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU2DS2AIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU2DS2AIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2DS2AIU */
#define IFX_MTU_MEMSTAT0_CPU2DS2AIU_OFF (21u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2DSAIU */
#define IFX_MTU_MEMSTAT0_CPU2DSAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2DSAIU */
#define IFX_MTU_MEMSTAT0_CPU2DSAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2DSAIU */
#define IFX_MTU_MEMSTAT0_CPU2DSAIU_OFF (0u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2DTAIU */
#define IFX_MTU_MEMSTAT0_CPU2DTAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2DTAIU */
#define IFX_MTU_MEMSTAT0_CPU2DTAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2DTAIU */
#define IFX_MTU_MEMSTAT0_CPU2DTAIU_OFF (2u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2PSAIU */
#define IFX_MTU_MEMSTAT0_CPU2PSAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2PSAIU */
#define IFX_MTU_MEMSTAT0_CPU2PSAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2PSAIU */
#define IFX_MTU_MEMSTAT0_CPU2PSAIU_OFF (3u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.CPU2PTAIU */
#define IFX_MTU_MEMSTAT0_CPU2PTAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2PTAIU */
#define IFX_MTU_MEMSTAT0_CPU2PTAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2PTAIU */
#define IFX_MTU_MEMSTAT0_CPU2PTAIU_OFF (5u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.FSI0AIU */
#define IFX_MTU_MEMSTAT0_FSI0AIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.FSI0AIU */
#define IFX_MTU_MEMSTAT0_FSI0AIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.FSI0AIU */
#define IFX_MTU_MEMSTAT0_FSI0AIU_OFF (26u)

