leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMtu_bf.h
/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.HSMCAIU */
#define IFX_MTU_MEMSTAT0_HSMCAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.HSMCAIU */
#define IFX_MTU_MEMSTAT0_HSMCAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.HSMCAIU */
#define IFX_MTU_MEMSTAT0_HSMCAIU_OFF (23u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.HSMRAIU */
#define IFX_MTU_MEMSTAT0_HSMRAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.HSMRAIU */
#define IFX_MTU_MEMSTAT0_HSMRAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.HSMRAIU */
#define IFX_MTU_MEMSTAT0_HSMRAIU_OFF (25u)

/** \brief  Length for Ifx_MTU_MEMSTAT0_Bits.HSMTAIU */
#define IFX_MTU_MEMSTAT0_HSMTAIU_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMSTAT0_Bits.HSMTAIU */
#define IFX_MTU_MEMSTAT0_HSMTAIU_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMSTAT0_Bits.HSMTAIU */
#define IFX_MTU_MEMSTAT0_HSMTAIU_OFF (24u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DS2EN */
#define IFX_MTU_MEMTEST0_CPU0DS2EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DS2EN */
#define IFX_MTU_MEMTEST0_CPU0DS2EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DS2EN */
#define IFX_MTU_MEMTEST0_CPU0DS2EN_OFF (27u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DSEN */
#define IFX_MTU_MEMTEST0_CPU0DSEN_OFF (14u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0DTEN */
#define IFX_MTU_MEMTEST0_CPU0DTEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0DTEN */
#define IFX_MTU_MEMTEST0_CPU0DTEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0DTEN */
#define IFX_MTU_MEMTEST0_CPU0DTEN_OFF (19u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0PSEN */
#define IFX_MTU_MEMTEST0_CPU0PSEN_OFF (16u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU0PTEN */
#define IFX_MTU_MEMTEST0_CPU0PTEN_OFF (17u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU1XEN */
#define IFX_MTU_MEMTEST0_CPU1XEN_LEN (6u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU1XEN */
#define IFX_MTU_MEMTEST0_CPU1XEN_MSK (0x3fu)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU1XEN */
#define IFX_MTU_MEMTEST0_CPU1XEN_OFF (6u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPU2XEN */
#define IFX_MTU_MEMTEST0_CPU2XEN_LEN (6u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPU2XEN */
#define IFX_MTU_MEMTEST0_CPU2XEN_MSK (0x3fu)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPU2XEN */
#define IFX_MTU_MEMTEST0_CPU2XEN_OFF (0u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.CPUXDS2EN */
#define IFX_MTU_MEMTEST0_CPUXDS2EN_LEN (2u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.CPUXDS2EN */
#define IFX_MTU_MEMTEST0_CPUXDS2EN_MSK (0x3u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.CPUXDS2EN */
#define IFX_MTU_MEMTEST0_CPUXDS2EN_OFF (20u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.ETHEN */
#define IFX_MTU_MEMTEST0_ETHEN_OFF (22u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.FSI0EN */
#define IFX_MTU_MEMTEST0_FSI0EN_OFF (26u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTM1AEN */
#define IFX_MTU_MEMTEST0_GTM1AEN_OFF (31u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMFEN */
#define IFX_MTU_MEMTEST0_GTMFEN_OFF (28u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMM0EN */
#define IFX_MTU_MEMTEST0_GTMM0EN_OFF (29u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.GTMM1EN */
#define IFX_MTU_MEMTEST0_GTMM1EN_OFF (30u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.LMUEN */
#define IFX_MTU_MEMTEST0_LMUEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.LMUEN */
#define IFX_MTU_MEMTEST0_LMUEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.LMUEN */
#define IFX_MTU_MEMTEST0_LMUEN_OFF (12u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.MMCDSEN */
#define IFX_MTU_MEMTEST0_MMCDSEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.MMCDSEN */
#define IFX_MTU_MEMTEST0_MMCDSEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.MMCDSEN */
#define IFX_MTU_MEMTEST0_MMCDSEN_OFF (13u)

/** \brief  Length for Ifx_MTU_MEMTEST0_Bits.Res */
#define IFX_MTU_MEMTEST0_RES_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST0_Bits.Res */
#define IFX_MTU_MEMTEST0_RES_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST0_Bits.Res */
#define IFX_MTU_MEMTEST0_RES_OFF (15u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML0EN */
#define IFX_MTU_MEMTEST1_EMEML0EN_OFF (14u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_MSK (0x1u)

