leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxMtu_bf.h
/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML1EN */
#define IFX_MTU_MEMTEST1_EMEML1EN_OFF (15u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML2EN */
#define IFX_MTU_MEMTEST1_EMEML2EN_OFF (16u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEML3EN */
#define IFX_MTU_MEMTEST1_EMEML3EN_OFF (17u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEMLXEN */
#define IFX_MTU_MEMTEST1_EMEMLXEN_LEN (12u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEMLXEN */
#define IFX_MTU_MEMTEST1_EMEMLXEN_MSK (0xfffu)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEMLXEN */
#define IFX_MTU_MEMTEST1_EMEMLXEN_OFF (18u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.EMEMUXEN */
#define IFX_MTU_MEMTEST1_EMEMUXEN_LEN (2u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.EMEMUXEN */
#define IFX_MTU_MEMTEST1_EMEMUXEN_MSK (0x3u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.EMEMUXEN */
#define IFX_MTU_MEMTEST1_EMEMUXEN_OFF (30u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY0MEN */
#define IFX_MTU_MEMTEST1_ERAY0MEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY0MEN */
#define IFX_MTU_MEMTEST1_ERAY0MEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.ERAY0MEN */
#define IFX_MTU_MEMTEST1_ERAY0MEN_OFF (8u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY0OEN */
#define IFX_MTU_MEMTEST1_ERAY0OEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY0OEN */
#define IFX_MTU_MEMTEST1_ERAY0OEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.ERAY0OEN */
#define IFX_MTU_MEMTEST1_ERAY0OEN_OFF (6u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY0TEN */
#define IFX_MTU_MEMTEST1_ERAY0TEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY0TEN */
#define IFX_MTU_MEMTEST1_ERAY0TEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.ERAY0TEN */
#define IFX_MTU_MEMTEST1_ERAY0TEN_OFF (7u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.ERAY1XEN */
#define IFX_MTU_MEMTEST1_ERAY1XEN_LEN (3u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.ERAY1XEN */
#define IFX_MTU_MEMTEST1_ERAY1XEN_MSK (0x7u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.ERAY1XEN */
#define IFX_MTU_MEMTEST1_ERAY1XEN_OFF (9u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.GTM1BEN */
#define IFX_MTU_MEMTEST1_GTM1BEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.GTM1BEN */
#define IFX_MTU_MEMTEST1_GTM1BEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.GTM1BEN */
#define IFX_MTU_MEMTEST1_GTM1BEN_OFF (0u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.GTM2EN */
#define IFX_MTU_MEMTEST1_GTM2EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.GTM2EN */
#define IFX_MTU_MEMTEST1_GTM2EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.GTM2EN */
#define IFX_MTU_MEMTEST1_GTM2EN_OFF (1u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.MCAN0EN */
#define IFX_MTU_MEMTEST1_MCAN0EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.MCAN0EN */
#define IFX_MTU_MEMTEST1_MCAN0EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.MCAN0EN */
#define IFX_MTU_MEMTEST1_MCAN0EN_OFF (4u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.MCAN1EN */
#define IFX_MTU_MEMTEST1_MCAN1EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.MCAN1EN */
#define IFX_MTU_MEMTEST1_MCAN1EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.MCAN1EN */
#define IFX_MTU_MEMTEST1_MCAN1EN_OFF (5u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.MCDSEN */
#define IFX_MTU_MEMTEST1_MCDSEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.MCDSEN */
#define IFX_MTU_MEMTEST1_MCDSEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.MCDSEN */
#define IFX_MTU_MEMTEST1_MCDSEN_OFF (13u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.PSI5EN */
#define IFX_MTU_MEMTEST1_PSI5EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.PSI5EN */
#define IFX_MTU_MEMTEST1_PSI5EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.PSI5EN */
#define IFX_MTU_MEMTEST1_PSI5EN_OFF (2u)

/** \brief  Length for Ifx_MTU_MEMTEST1_Bits.STBY1EN */
#define IFX_MTU_MEMTEST1_STBY1EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST1_Bits.STBY1EN */
#define IFX_MTU_MEMTEST1_STBY1EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST1_Bits.STBY1EN */
#define IFX_MTU_MEMTEST1_STBY1EN_OFF (12u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.CIF0EN */
#define IFX_MTU_MEMTEST2_CIF0EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.CIF0EN */
#define IFX_MTU_MEMTEST2_CIF0EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.CIF0EN */
#define IFX_MTU_MEMTEST2_CIF0EN_OFF (14u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.CIFxEN */
#define IFX_MTU_MEMTEST2_CIFXEN_LEN (2u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.CIFxEN */
#define IFX_MTU_MEMTEST2_CIFXEN_MSK (0x3u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.CIFxEN */
#define IFX_MTU_MEMTEST2_CIFXEN_OFF (16u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.DAMEN */
#define IFX_MTU_MEMTEST2_DAMEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.DAMEN */
#define IFX_MTU_MEMTEST2_DAMEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.DAMEN */
#define IFX_MTU_MEMTEST2_DAMEN_OFF (15u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.DMAEN */
#define IFX_MTU_MEMTEST2_DMAEN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.DMAEN */
#define IFX_MTU_MEMTEST2_DMAEN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.DMAEN */
#define IFX_MTU_MEMTEST2_DMAEN_OFF (19u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.EMEMUxEN */
#define IFX_MTU_MEMTEST2_EMEMUXEN_LEN (14u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.EMEMUxEN */
#define IFX_MTU_MEMTEST2_EMEMUXEN_MSK (0x3fffu)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.EMEMUxEN */
#define IFX_MTU_MEMTEST2_EMEMUXEN_OFF (0u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.FFT0EN */
#define IFX_MTU_MEMTEST2_FFT0EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.FFT0EN */
#define IFX_MTU_MEMTEST2_FFT0EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.FFT0EN */
#define IFX_MTU_MEMTEST2_FFT0EN_OFF (22u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.FFT1EN */
#define IFX_MTU_MEMTEST2_FFT1EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.FFT1EN */
#define IFX_MTU_MEMTEST2_FFT1EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.FFT1EN */
#define IFX_MTU_MEMTEST2_FFT1EN_OFF (23u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.STBY2EN */
#define IFX_MTU_MEMTEST2_STBY2EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.STBY2EN */
#define IFX_MTU_MEMTEST2_STBY2EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.STBY2EN */
#define IFX_MTU_MEMTEST2_STBY2EN_OFF (18u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.XTM0EN */
#define IFX_MTU_MEMTEST2_XTM0EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.XTM0EN */
#define IFX_MTU_MEMTEST2_XTM0EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.XTM0EN */
#define IFX_MTU_MEMTEST2_XTM0EN_OFF (20u)

/** \brief  Length for Ifx_MTU_MEMTEST2_Bits.XTM1EN */
#define IFX_MTU_MEMTEST2_XTM1EN_LEN (1u)

/** \brief  Mask for Ifx_MTU_MEMTEST2_Bits.XTM1EN */
#define IFX_MTU_MEMTEST2_XTM1EN_MSK (0x1u)

/** \brief  Offset for Ifx_MTU_MEMTEST2_Bits.XTM1EN */
#define IFX_MTU_MEMTEST2_XTM1EN_OFF (21u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXMTU_BF_H */
